{"dls4qu9": {"body": ">The Cleveland Clinic said in a statement that it decided not to hold its annual event at his Palm Beach resort after “careful consideration” of a number of issues. It didn’t elaborate, but the Ohio-based hospital was already under pressure to shift venues.\n\n>Doctors, nurses and medical students of the hospital had signed a public letter earlier this year objecting to Mar-a-Lago given President Trump’s plans to cut funding of medical research and other policies.\n\n>**The Cleveland Clinic has held its annual fundraiser at the resort for eight years.**\n\n&nbsp;\n>A few hours after the hospital pulled out, the American Cancer Society said it also planned to shift the venue of its annual fundraiser, called the 2018 Island of Palm Beach gala.\n\n>“Our values and commitment to diversity are critical as we work to address the impact of cancer in every community,” spokeswoman Miriam Falco said in statement. **“It has become increasingly clear that the challenge to those values is outweighing other business considerations.”**\n\n>Falco declined to elaborate.\n\n&nbsp;\n>Late Thursday, the American Friends of Magen David Adom announced it had decided not to hold its 2018 fundraiser at Mar-a-Lago. **The group, which raises money for an ambulance service in Israel, has been holding its annual gala at the resort since 2012.**\n\n>Its spokesman, Erik Levis, gave no reason but said the decision came after “considerable deliberation.” His statement noted the organization is “apolitical.”\n\n", "downs": 0, "created_utc": 1503021536.0, "subreddit": "politics", "score": 483, "ups": 483}}{"dls4caf": {"body": "Its funny that this is what it took. Not the [359 other things.](https://www.nytimes.com/interactive/2016/01/28/upshot/donald-trump-twitter-insults.html?mcubz=1)", "downs": 0, "created_utc": 1503021021.0, "subreddit": "politics", "score": 73, "ups": 73}}{"dls40wc": {"body": "Good.  Let that stupid empire crumble.  And let everyone think \"dirtbag\" anytime they hear the name Trump.", "downs": 0, "created_utc": 1503020624.0, "subreddit": "politics", "score": 128, "ups": 128}}{"dlseke9": {"body": "It blows my mind how easy of a job this was for Trump to not fuck up, yet he still manages to fuck it up. Just condemn the white supremacists. It's that easy. Say, \"I condemn the white supremacists, this country will not tolerate such hate\". Boom, problem solved and it's one less shitshow on his plate. As a businessman, you gotta at least understand what the people want.", "downs": 0, "created_utc": 1503037551.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsdsqp": {"body": "John Oliver voice: \"*Cool*.\"\n\nAfter all the reporting of 2016 showing how much of a scam Mar-a-Lago was and how toxic it *already was*, I don't give a ton of credit to the companies bowing out now. And interesting parallel though:\n\nWhen the NC bathroom bill was a big deal, Trump came out \"against\" it. That's part of where the \"Trump is secretly pro-lgbt\" line comes from. But his statement at the time had a qualifier that most people ignored. He said NC was foolish to push for the bill because of how much tourism business they lost via the boycott. He didn't say it was a bad bill or a discriminatory bill, etc etc. He said it was bad because of the cost to the state the backlash incurred. (As in, if there was no boycott, he wouldn't have had a problem with the bill, or wouldn't have spoken out about it.)\n\nTrump shouldn't have got credit then, and these companies don't get much credit now. The interesting thing tying these two together though, is that Trump is a walking NC bathroom bill now, and by his own campaign rhetoric, he should be calling himself foolish for pushing the white nationalist stuff and incurring a boycott of his property.", "downs": 0, "created_utc": 1503035891.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls7j7v": {"body": "I'll never give money to these charities, now that I know they were giving it to Trump in the first place. I'm glad people are pissed at Trump now, but if you didn't have a problem with him raping women and making fun of handicapped people, I'm not really impressed that you've taken a stand against anything that's come since. ", "downs": 0, "created_utc": 1503025326.0, "subreddit": "politics", "score": 25, "ups": 25}}{"dls80b5": {"body": "I'm also guessing Trump wasn't offering the venue to charities at a discounted rate, like a person with a conscience would. Guess he's going to lose out on some $. SAD!", "downs": 0, "created_utc": 1503026017.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls8ykc": {"body": "This is the best tl;dr I could make, [original](https://apnews.com/51b4149b0f3a426ba363af47bbdc3a61/3-charities-cancel-Mar-a-Lago-events-amid-Trump-backlash) reduced by 89%. (I'm a bot)\n*****\n> Three charities announced Thursday that they were canceling fundraisers at Trump&#039;s Mar-a-Lago resort, a sign the president&#039;s business is starting to suffer backlash from his comments Tuesday about the violence in Charlottesville, Virginia.\n\n> The gilded and glittering Mar-a-Lago has been a favorite spot for holding charity events and a money maker for the Trump Organization.\n\n> Palm Beach town records showed that 21 charities held events at Mar-a-Lago between last November and April, during the active social season.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/6ufb3o/3_charities_cancel_maralago_events_amid_trump/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 1.65, ~193519 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Trump**^#1 **Mar-a-Lago**^#2 **President**^#3 **fundraiser**^#4 **annual**^#5", "downs": 0, "created_utc": 1503027434.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsfy2o": {"body": "Just quit, Trump. ", "downs": 0, "created_utc": 1503040798.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls4605": {"body": "That's okay. Rank and file Trump supporters can still rent it out. Because he's a man of the pee pee. Damn Fraudian slip. I mean people. Man of the people.", "downs": 0, "created_utc": 1503020804.0, "subreddit": "politics", "score": 6, "ups": 6}}{"dls4nd2": {"body": "The only people we should see at a Trump branded property is the Alt Right\n\nIf you're at a trump property, you're a card carrying member ", "downs": 0, "created_utc": 1503021417.0, "subreddit": "politics", "score": 6, "ups": 6}}{"dlsau9b": {"body": "It's okay, Trump will make all that money back when the \"alt-right\" move all of their events there!", "downs": 0, "created_utc": 1503030396.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsb458": {"body": " Sadly,  this might be the one thing that forces Trump to, at least publicly,  change his position. ", "downs": 0, "created_utc": 1503030863.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlscwym": {"body": "Remember when Trumpedes were posting that photoshopped image of Hillary and Robert Byrd? Seems like so long ago. Now they're probably afraid to show that image because too many people would start liking her because of it. I wish I was joking.", "downs": 0, "created_utc": 1503034137.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsdlem": {"body": "How amazing would it be if Trump suddenly came to Jesus about not profiting from his businesses while in office?", "downs": 0, "created_utc": 1503035466.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsdqdb": {"body": "I think probably of all the things that have made Trump mad over the last few months (low polling numbers, inability to get anything passed in congress, etc...), this one will be what really makes him angry.  This one is affecting his businesses and his income and that is pretty much all he cares about.  I can't wait to see him complaining about the American Cancer Society, people who activity try to prevent others from dying of cancer.", "downs": 0, "created_utc": 1503035756.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsf43h": {"body": "These are the kinds of actions we need. \n\nTrump is in a terrible Catch 22 right now. He probably doesn't want to be President, but he can't quit because he loses his power to pardon, and he would be leaving in disgrace. ", "downs": 0, "created_utc": 1503038804.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsebb5": {"body": "Trump is an absolute psychopath. Additionally, he is a racist scumbag. Underneath it all are more layers of an even longer and more despicable shitshow. ", "downs": 0, "created_utc": 1503036993.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls7007": {"body": "Why would anyone have their fucking charity ball at a Trump venue, anyway? Note that two are medical. \n\nWhat are these people thinking?", "downs": 0, "created_utc": 1503024563.0, "subreddit": "politics", "score": 5, "ups": 5}}{"dlscwy1": {"body": "BOYCOTT all trump properties. ", "downs": 0, "created_utc": 1503034136.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsgb7q": {"body": "Funniest part of this whole thing:\n\nProbably could change trump's actions more by hurting him financially, than you could in any other legitimate political manner.\n\nProtest? Pssh.\nCut the bottom line? All hell.", "downs": 0, "created_utc": 1503041721.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlshghy": {"body": "Who were the charities going to benefit the most if they're held at Mar-a-Lago?  Donald Trump, that's who.  I'm pretty sure he was going to charge them twice as much then the year before beings he doubled his rates after becoming President Scrooge.   ", "downs": 0, "created_utc": 1503044685.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlse6zd": {"body": "Why would any charity be involved with the Trump Organization? They are frauds and never give the money to charities. These are basic facts.", "downs": 0, "created_utc": 1503036732.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsh0g5": {"body": "So, if Trump complains about this at all, is he violating the emoluments clause...?", "downs": 0, "created_utc": 1503043508.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsay80": {"body": "Anyway we can get a list of charities planning events at Trump establishments?", "downs": 0, "created_utc": 1503030586.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsb6d5": {"body": "how could any organization that is not directly trying to bribe him, or are very hardcore Trump supporters, still give this dude any of their money.  ", "downs": 0, "created_utc": 1503030967.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsf6c0": {"body": "The whole notion of the existence of \"charities\" fundraising at a place like Mar-a-Lago symbolizes much of what's wrong with the US, regardless of the existence of Trump.\n\nAnd I don't believe the two are not connected. Both are the result of a lack of proper public services despite being the wealthiest nation ever, starting with education.", "downs": 0, "created_utc": 1503038946.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsf3hc": {"body": "Does anyone remember the last pro-trump upvoted submission on the ever so neutral subreddit, /r/politics?", "downs": 0, "created_utc": 1503038762.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsicw1": {"body": "Abandon the trump train!!!!", "downs": 0, "created_utc": 1503047164.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsio36": {"body": "ITT: sort by controversial, find spray paint huffing trump butt licking trolls", "downs": 0, "created_utc": 1503048029.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsiz87": {"body": "Trump will always be able to cater to the same sort of people who buy artwork from George Zimmerman.", "downs": 0, "created_utc": 1503048891.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsj3bc": {"body": "Trump is done now!", "downs": 0, "created_utc": 1503049222.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsja3b": {"body": "Not a problem for Trump's business; he just has to schedule more golfing visits for himself & his entourage to make up for these cancellations so that the taxpayers make up for any of his business losses.", "downs": 0, "created_utc": 1503049750.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsk2xl": {"body": "[Trump logic](https://youtu.be/YWrqvnSVmTw)", "downs": 0, "created_utc": 1503051919.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlskgwq": {"body": "Any cancer charity that held events at a trump brand property I would just assume that their mission would be to give people cancer.", "downs": 0, "created_utc": 1503052894.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsl1r8": {"body": "And which charities are still having events at Trump properties?", "downs": 0, "created_utc": 1503054274.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsbq3h": {"body": "*Loser handicaps looking for handouts!*\n\n-Probably Donald Trump", "downs": 0, "created_utc": 1503031930.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsknav": {"body": "You're talking about a man who [stole money from a kids with cancer charity.](https://www.forbes.com/sites/danalexander/2017/06/06/how-donald-trump-shifted-kids-cancer-charity-money-into-his-business/#25d4bb2d6b4a) You think it'd hurt him to badmouth charities on Twitter? ", "downs": 0, "created_utc": 1503053321.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsb9oh": {"body": "The charities would receive an uptick in donations, and Trump will take credit.", "downs": 0, "created_utc": 1503031126.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlshh63": {"body": "Trump is the world's cancer.", "downs": 0, "created_utc": 1503044738.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsi7fl": {"body": "So how long until Trump shits all over the American Cancer Society in a tweet?", "downs": 0, "created_utc": 1503046743.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlschqv": {"body": "That's kinda what he said when the Trump Taj Mahal opened. The slots had to be closed down due to violations, or something not working properly. But he said so many people came, they broke the machines.", "downs": 0, "created_utc": 1503033346.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls523b": {"body": "I can totally see this sequence of tweets. Anything is possible with trump", "downs": 0, "created_utc": 1503021931.0, "subreddit": "politics", "score": 10, "ups": 10}}{"dls9ym8": {"body": "Why were charities booking there in the first place? The Trump's don't have the best record mixing finances and charities. Trump will just use that money to buy autographed footballs and portraits of himself. ", "downs": 0, "created_utc": 1503028976.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls4k82": {"body": "Are you Donald Trump?", "downs": 0, "created_utc": 1503021305.0, "subreddit": "politics", "score": 9, "ups": 9}}{"dlsbyr9": {"body": "it would be nice if trumps BS actually started to hurt his bottom line, unfortunately he is president, and while a nazi, there will be an endless line of people who want access. and more than enough who have no problems with nazis\n", "downs": 0, "created_utc": 1503032366.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls419o": {"body": "Depends, his [income and net worth are based on his mood and how he feels that day] (https://www.washingtonpost.com/news/wonk/wp/2017/08/17/lawrence-summers-trumps-ceos-resigned-his-cabinet-should-do-the-same/?utm_term=.b3fbdfbaea6a) so he might not even notice!", "downs": 0, "created_utc": 1503020639.0, "subreddit": "politics", "score": 196, "ups": 196}}{"dls4zyd": {"body": "Enemy of an enemy is a friend. \n\nUntil he attacks you and your members, it seems like he's a supporter.\n\nThat is, until it becomes apparent that Trump is out for himself and no one else even registers.", "downs": 0, "created_utc": 1503021855.0, "subreddit": "politics", "score": 16, "ups": 16}}{"dlsfrs6": {"body": "> Palm Beach Police Foundation\n\nRemember Donald Trump's fake charity, and how Trump would take donations from other people and then give that money to other organizations but branded as a donation from Donald Trump? The Palm Beach Police Foundation does. They got a $150,000 donation from Trump.......'s charity but more specifically from a completely different group that gave the money to Trump's Charity. The PBPF then held a dinner in Trump's honor. At Mar-a-Lago. For which Mar-a-Lago, and therefore Trump, charged the foundation the rental of the space.\n\nhttps://www.washingtonpost.com/politics/how-donald-trump-retooled-his-charity-to-spend-other-peoples-money/2016/09/10/da8cce64-75df-11e6-8149-b8d05321db62_story.html\n\nThere's a good chance that the PBPF has, wittingly or not, helped Trump launder money.", "downs": 0, "created_utc": 1503040358.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsapt9": {"body": "That won't happen. To run a business, you only need a small niche. Trump has the alt right niche that will tour his shit hole hotels no matter what.", "downs": 0, "created_utc": 1503030191.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsfouu": {"body": "But he actually likes them, so his ego will not allow him to say that.  If the Nazis were instead protesting Trump, he'd condemn them in a split second.", "downs": 0, "created_utc": 1503040160.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls5oi9": {"body": "Like this one: http://abcnews.go.com/Politics/eric-trump-funneled-cancer-charity-money-businesses-associates/story?id=47878610\n\nI don't know if there is a way to get a list of all charities that hold events at Mar-a-Lago. That would be just tremendous, beautiful really if you ask me. ", "downs": 0, "created_utc": 1503022758.0, "subreddit": "politics", "score": 23, "ups": 23}}{"dls7tfd": {"body": "Most charities hold these kinds of fundraising events. I attended one (for an organization that provides job training for people in poverty) where a single individual made a $20k donation during a public donations portion. It's actually quite effective. \n\nThat said, I've never been anywhere as tacky as a Trump property in all my life. ", "downs": 0, "created_utc": 1503025739.0, "subreddit": "politics", "score": 23, "ups": 23}}{"dlsh2hm": {"body": "To be fair, some of the people at trump properties are foreign intelligence agents just doing their jobs.", "downs": 0, "created_utc": 1503043661.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsfknu": {"body": "Does anyone remember something positive from trump that would be news worthy and big enough to post despite the shit he pulls out of his ass every day? ", "downs": 0, "created_utc": 1503039875.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsf7ee": {"body": "He's already disrespected a charity for children with AIDS. [This article] (https://www.washingtonpost.com/politics/trump-boasts-of-his-philanthropy-but-his-giving-falls-short-of-his-words/2016/10/29/b3c03106-9ac7-11e6-a0ed-ab0774c1eaa5_story.html?utm_term=.54d84f69975c) covers the event. It is unbelievable.", "downs": 0, "created_utc": 1503039016.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlshzox": {"body": "Is there a limit with the Trump cult? ", "downs": 0, "created_utc": 1503046160.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsgi2q": {"body": "Nothing is safe for the Trump God King of America ", "downs": 0, "created_utc": 1503042196.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsk9ul": {"body": "Trump thinks the law does not apply to him.  He loves the law when he is using it to beat someone else. ", "downs": 0, "created_utc": 1503052407.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsggip": {"body": "Remember he has a lot of properties,https://en.wikipedia.org/wiki/The_Trump_Organization ", "downs": 0, "created_utc": 1503042092.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls60qk": {"body": "If only Donald had twitter in high school", "downs": 0, "created_utc": 1503023206.0, "subreddit": "politics", "score": 18, "ups": 18}}{"dls9uoi": {"body": "Regardless of the modern Trump dumpster fire, what kind of real charity would have events at Mar-a-lago.  You know that Trump wasn't comping any of these events, he wouldn't even comp his son's cancer charity shit.  These \"charity\" events seem like the biggest circle jerk where everyone celebrates being great people writing checks that go almost exclusively into paying off their evening's expensive celebration and the logistics behind it.", "downs": 0, "created_utc": 1503028805.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsc78w": {"body": "The article did say that it's about the only venue in the area that could hold so many people. If you're wanting access to huge donors in the palm beach area you'd better get yourself to where they are. I can understand the logistical need to be there, but it sure does redirect badly in any charity that does continue to use it. Especially the red Cross while Trump is hiring refugees, or health groups while he's trying to kill healthcare.", "downs": 0, "created_utc": 1503032803.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsd10h": {"body": ">  The Trump's don't have the best record mixing finances and charities.\n\nDepends on what you mean by \"best record.\" Smart swindlers are jumping ship, too.", "downs": 0, "created_utc": 1503034351.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlshnnq": {"body": ">  trumps BS actually started to hurt his bottom line,\n\nI'm hoping Mueller and the New York AG will hit him where it hurts.", "downs": 0, "created_utc": 1503045236.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsd7cn": {"body": "That's such a telling example of who he is. On the one hand, it's admirable to attach your \"net worth\" to something other than a number in the bank or whatever. On the other, it's Trump, so it's not some humble statement about the value of friendship and the small things in life, it's \"No matter what it is, I don't really have to worry, so it's however I feel at the moment.\"", "downs": 0, "created_utc": 1503034693.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsdr57": {"body": "The Eric trump foundation donates to his father? What the fuck man \n\nEdit: or used to, but still", "downs": 0, "created_utc": 1503035800.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls53b9": {"body": "Its baffling to me why any corporation that isn't Fox News would want themselves to be associated with Trump in any way.", "downs": 0, "created_utc": 1503021976.0, "subreddit": "politics", "score": 15, "ups": 15}}{"dlsaa5j": {"body": "There must be a bot that makes new Trump tweets out of fragments of old ones.", "downs": 0, "created_utc": 1503029485.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsi73z": {"body": "There is no limit to how scummy Trump can be. That 'foundation' is a bunch of shit and i wish everyone knew about it. That's classic, egotistical, selfish Trump to want to see his name on that donation and receive all the praise. ", "downs": 0, "created_utc": 1503046719.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls83qq": {"body": "LoL at the prospect of \"negative pricing\" - trump properties paying to have people use the properties.  \"Trump paid me $3000 to hold my wedding at ______\"", "downs": 0, "created_utc": 1503026156.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsayi5": {"body": "He loves this one amazing charity \"Trump Foundation\" which does great things for the community like purchasing paintings of the Nazi in Chief", "downs": 0, "created_utc": 1503030599.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsbzlu": {"body": "In fact, his son stole from charities.  The Trump family is pure evil.", "downs": 0, "created_utc": 1503032411.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsay51": {"body": "Flipping back and forth between Fox and MSNBC today was a thing.  I was disappointed MSNBC had little coverage of the terrorist attack in Barcelona (that I saw...that channel is mostly insufferable ads).  Fox was all Barcelona but would never mention the Trump tweet about destroying statues made to make black folk uncomfortable (that I saw...that channel is mostly insufferable ads). ", "downs": 0, "created_utc": 1503030582.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsg5uy": {"body": "I am a lot less upset now that McCain has handed Trump his balls and supported so many questionable nominees.  While I certainly respect his service and am grateful he took a stand on the absurd healthcare bill, he has not done nearly as much as he should.  Harsh words but very little action after trump has disrespected him.  If it weren't for Susan Collins his healthcare vote wouldn't have even mattered.", "downs": 0, "created_utc": 1503041340.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsk8xx": {"body": ">Every fucking time I am reminded of him insulting McCain POW status, I just fucking die a little. I can not believe people still support him after that. It's just beyond any reason I can cope with. \n\nHis supporters think it's just shit-talking. Like going onto an athletics field and ripping on your opponent's clothes, or appearance, habits, parents, spouses, etc. A little crudeness is acceptable, and if you go a little over the line, you didn't really mean it, so you can apologize and move on. \n\nThe problem, of course, is that Trump always means it. He doesn't have layers, or filters, or tactics. If he says \"I like people who weren't captured\", he will never then say \"Okay, maybe that was over the line\".  He doesn't ever apologize. His hardcore base sees that as a sign of strength - he means what he says, and diplomacy is for pussies. But a growing number of people are realizing that a) diplomacy does serve a purpose, b) presidents play their games at too high a level for shit-talking to help much, and c) Trump's shit-talking is revealing what a truly horrible, stupid person he is. It's why, half a year into his presidency, he's accomplished so little. ", "downs": 0, "created_utc": 1503052344.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlskvmf": {"body": "Yes. Anything that Fox isn't willing to find a defence for.\n\nAnd the Murdocks look to be angry with 'ol racist trump at the moment. ", "downs": 0, "created_utc": 1503053877.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsd9lz": {"body": "if only Donald smoked weed in high school", "downs": 0, "created_utc": 1503034818.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsf3xc": {"body": "Florida based, golf-related charities, maybe?\n\nBut yeah, I don't know why a charity would book a venue that is probably horrendously overpriced (let's face it, this is Trump) and thoroughly lacking in anything decorous or understated (again... Trump). Hardly the most altruistic location for an event, is it?", "downs": 0, "created_utc": 1503038792.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlshdud": {"body": "> he wouldn't even comp his son's cancer charity shit.\n\nhttps://www.cnbc.com/2017/06/06/trump-organization-charged-eric-trumps-cancer-charity-golf-events.html\n\nIt never ends with this motherfucker.", "downs": 0, "created_utc": 1503044490.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsge6n": {"body": "It's ridiculous to say apathy is equal to the hate trump and friends are spewing. ", "downs": 0, "created_utc": 1503041930.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsip1j": {"body": "The decisions (or statements) trump makes shouldn't hurt OR HELP his \"bottom line\". That's exactly why the Emoluments Clause is in the constitution -which he took an oath to uphold -while a man wearing a nazi medal was sitting in his gallery.", "downs": 0, "created_utc": 1503048100.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsbtaa": {"body": "It'd be indistinguishable from the real Trump.", "downs": 0, "created_utc": 1503032091.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dls8xim": {"body": "As long as he can charge it to someone else, he's willing to go that far. His campaign hired actors to play supporters at early appearances, then skipped out on paying them in full.\n\nhttps://www.washingtonpost.com/news/the-fix/wp/2017/01/20/even-the-firm-that-hired-actors-to-cheer-trumps-campaign-launch-had-to-wait-to-be-paid/", "downs": 0, "created_utc": 1503027390.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlseq63": {"body": "Not for money, but for Trump's ego.", "downs": 0, "created_utc": 1503037915.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsc2gf": {"body": ">  He loves this one amazing charity \"Trump Foundation\" \n\nHe loves it so much that [he tried to shut it down](https://www.cbsnews.com/news/n-y-attorney-generals-office-trump-cant-shut-down-foundation-until-investigation-ends/) while NY state was investigating it's dealings.", "downs": 0, "created_utc": 1503032558.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsjb83": {"body": ">Trump = Nazi \n\nOh okay then. ", "downs": 0, "created_utc": 1503049838.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlse3x9": {"body": "Jr. owns the winery in charlottesville that Trump Sr. claimed to own over the weekend when defending nazis. so who owns the business?", "downs": 0, "created_utc": 1503036545.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsies9": {"body": "But luckily for us, they are evil *and* stupid. Just imagine if someone competent tried to ruin America instead of the Trumps.", "downs": 0, "created_utc": 1503047312.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsdnbl": {"body": "If only Donald's mom had gone for oral instead of anal.", "downs": 0, "created_utc": 1503035577.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlse7ea": {"body": "If only Donald had bone spurs.", "downs": 0, "created_utc": 1503036758.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsf16l": {"body": "\"There's a cure for trumps hair?!??\" (Starts riot)", "downs": 0, "created_utc": 1503038615.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsjw68": {"body": "I don't think that's what they mean at all. Plenty of people will continue doing business with Trump because they don't care about anything other than their bottom line.", "downs": 0, "created_utc": 1503051434.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsghbe": {"body": "They're *really* good propagandists. And as long as the Koch Brothers and Murdock can continue to schlock their bullshit to an intellectually vulnerable audience., there shouldn't be any problem with hitching a ride on Trump. ", "downs": 0, "created_utc": 1503042145.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsi9kn": {"body": "\"Look, having nuclear—my uncle was a great professor and scientist and engineer, Dr. John Trump at MIT; good genes, very good genes, OK, very smart, the Wharton School of Finance, very good, very smart—you know, if you’re a conservative Republican, if I were a liberal, if, like, OK, if I ran as a liberal Democrat, they would say I'm one of the smartest people anywhere in the world—it’s true!—but when you're a conservative Republican they try—oh, do they do a number—that’s why I always start off: Went to Wharton, was a good student, went there, went there, did this, built a fortune—you know I have to give my like credentials all the time, because we’re a little disadvantaged—but you look at the nuclear deal, the thing that really bothers me—it would have been so easy, and it’s not as important as these lives are (nuclear is powerful; my uncle explained that to me many, many years ago, the power and that was 35 years ago; he would explain the power of what's going to happen and he was right—who would have thought?), but when you look at what's going on with the four prisoners—now it used to be three, now it’s four—but when it was three and even now, I would have said it's all in the messenger; fellas, and it is fellas because, you know, they don't, they haven’t figured that the women are smarter right now than the men, so, you know, it’s gonna take them about another 150 years—but the Persians are great negotiators, the Iranians are great negotiators, so, and they, they just killed, they just killed us.\"", "downs": 0, "created_utc": 1503046908.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlse14u": {"body": "Maybe someone has already and it's realDonaldTrump.", "downs": 0, "created_utc": 1503036382.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlscqvi": {"body": "My fav titbit: he is such a turd he used the foundation's money to pay for Barron's scout registration fee. For $7 measly dollars.\n\nhttps://www.washingtonpost.com/amphtml/politics/trump-boasts-of-his-philanthropy-but-his-giving-falls-short-of-his-words/2016/10/29/b3c03106-9ac7-11e6-a0ed-ab0774c1eaa5_story.html\n\nhttps://www.bustle.com/p/did-trump-once-pay-his-sons-boy-scout-registration-fee-with-charity-money-72545\n\nHe stole 7 fucking dollars from his own \"charity\" because he is such a cheap asshole.", "downs": 0, "created_utc": 1503033818.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsktbo": {"body": ">So who owns the business? \n\nDepends whose asking. Depends whose listening. Donald only owns the business as long as he isn't playing at being president that day.", "downs": 0, "created_utc": 1503053722.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsky13": {"body": "Jr. doesn’t own it, Eric Trump does.", "downs": 0, "created_utc": 1503054033.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsdbk7": {"body": "Trump is a fascist.\n\n.\n\n.\n \n...ooops", "downs": 0, "created_utc": 1503034927.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlskwsr": {"body": "He didn't steal 7 dollars. Did you even bother to read the article? It's \"alleged\". It's not a fact. But since it's posted in an article attributed to an anonymous source, it happened. Then you spread it as fact. \n\nOne question: If Trump is such a bad guy why make shit up? ", "downs": 0, "created_utc": 1503053954.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsi3wt": {"body": "For some people spending $7 is something they need to think carefully about.\n\nDonnie Trump is not one of those people.\n\n", "downs": 0, "created_utc": 1503046475.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsj2lx": {"body": "Oh I'm sorry, did you not hear about the six foot tall self portrait he bought with 20k of charity money? I hear it was very good, the artist literally spent a whole five minutes on it. \n\nIt's okay though, he needed it really badly to go with the 10k one he bought using charity funds the year before. \n\nhttps://www.washingtonpost.com/news/post-politics/wp/2016/11/01/this-is-the-portrait-of-himself-that-donald-trump-bought-with-20000-from-his-charity/", "downs": 0, "created_utc": 1503049167.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsl1wu": {"body": "Here is the bit from the article:\n\n> New findings, for instance, show that the Trump Foundation’s largest-ever gift — $264,631 — was used to renovate a fountain outside the windows of Trump’s Plaza Hotel.\n\n> Its smallest-ever gift, for $7, was paid to the Boy Scouts in 1989, at a time when it cost $7 to register a new Scout. Trump’s oldest son was 11 at the time. Trump did not respond to a question about whether the money was paid to register him.\n\nYou are right. Maybe it's all just one big misunderstanding, I'm sure there is a perfectly reasonable explanation of why he gave a charitable organisation 7 friggin dollars and then -refused to explain- why. Maybe it was a donation for a new... something that costs 7 dollars.\n\nBy the way, you do know that foundations accounts are PUBLIC RECORD so that is where this information came from... not an anonymous source, this information came from little Donnie himself.", "downs": 0, "created_utc": 1503054285.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsj3hk": {"body": "Maybe it was during the hard times, [Ivanka once said Donald](https://www.youtube.com/watch?v=hCer9g-fh8o) pointed at a homeless man and said that guys has 8bn dollars more than me, because he was so in debt. If you'd believe it that is.", "downs": 0, "created_utc": 1503049235.0, "subreddit": "politics", "score": 1, "ups": 1}}{"dlsghk0": {"body": "So that's what Trump meant when he said trickle down economics. ", "downs": 0, "created_utc": 1503042159.0, "subreddit": "funny", "score": 7, "ups": 7}}{"dlsh9sn": {"body": "Trumped up, though.", "downs": 0, "created_utc": 1503044190.0, "subreddit": "funny", "score": 9, "ups": 9}}{"dlshu8n": {"body": "Trumped up trickle down economics\n\n", "downs": 0, "created_utc": 1503045736.0, "subreddit": "funny", "score": 1, "ups": 1}}{"dlsi27u": {"body": "Don't attribute that to Trump. Reagonomics is a real thing that I highly doubt Trump actually grasps beyond knowing it's something GOP supporters want to hear. ", "downs": 0, "created_utc": 1503046349.0, "subreddit": "funny", "score": 4, "ups": 4}}{"dlsjf00": {"body": ">Although so-called Islamic State has released a statement saying what it calls its \"soldiers\" had carried out the Barcelona attack\n\nIts \"soldiers\" blew themselves up a little bit before the attack. You need to be quite the fucking idiot to not even be able to kill yourself properly. Fuck these guys.\n\n&nbsp;\n\nEDIT: [Trump pushes debunked 'pig's blood' myth, hours after Barcelona attack](http://www.bbc.co.uk/news/world-us-canada-40969475)\n\nWhat a fucking idiot.", "downs": 0, "created_utc": 1503050129.0, "subreddit": "worldnews", "score": 1, "ups": 1}}